package oleksandr.jobbit_back.entity;

/**
 * Перелічення (enum) {@code Role} представляє можливі ролі користувачів у системі.
 * Кожен користувач може мати одну з визначених ролей, що визначає його права та рівень доступу.
 *
 * @author Oleksandr Borovyk
 */
public enum Role {
    /**
     * Роль кандидата, що представляє звичайного користувача, який шукає роботу.
     */
    CANDIDATE,

    /**
     * Роль рекрутера, що представляє користувача, який публікує вакансії та наймає кандидатів.
     */
    RECRUITER,

    /**
     * Роль адміністратора, який може керувати користувачами та іншими аспектами.
     */
    ADMIN
}
